content/posts/git-tips.org
#+options: ':nil -:nil ^:{} num:nil toc:nil
#+author: Prasad Ghole
#+creator: Emacs 28.2 (Org mode 9.5.5 + ox-hugo)
#+hugo_with_locale:
#+hugo_front_matter_format: toml
#+hugo_level_offset: 1
#+hugo_preserve_filling:
#+hugo_delete_trailing_ws:
#+hugo_bundle:
#+hugo_base_dir: ../
#+hugo_goldmark:
#+hugo_code_fence:
#+hugo_use_code_for_kbd:
#+hugo_prefer_hyphen_in_tags:
#+hugo_allow_spaces_in_tags:
#+hugo_auto_set_lastmod:
#+hugo_custom_front_matter: :toc false :summary Git tool tips
#+hugo_blackfriday:
#+hugo_front_matter_key_replace:
#+hugo_date_format: %Y-%m-%dT%T%z
#+hugo_paired_shortcodes:
#+hugo_pandoc_citations:
#+bibliography:
#+html_container:
#+html_container_class:
#+hugo_aliases:
#+hugo_audio:
#+date: <2025-04-20 Sun>
#+description:
#+hugo_draft: false
#+hugo_expirydate:
#+hugo_headless:
#+hugo_images:
#+hugo_iscjklanguage:
#+keywords:
#+hugo_layout:
#+hugo_lastmod:
#+hugo_linktitle:
#+hugo_locale:
#+hugo_markup:
#+hugo_menu:
#+hugo_menu_override:
#+hugo_outputs:
#+hugo_publishdate:
#+hugo_series:
#+hugo_slug:
#+hugo_tags: "git"
#+hugo_categories:
#+hugo_resources:
#+hugo_type:
#+hugo_url:
#+hugo_videos:
#+hugo_weight:
#+TITLE: GitTips

* Working with Forked repos
** Merge changes from forked repo 
For my neovim kickstart I have forked the  https://github.com/nvim-lua/kickstart.nvim.git
to sync my changes with this branch I need to regularly merge this
branch master changes.

#+begin_src shell
git remote add upstream https://github.com/nvim-lua/kickstart.nvim.git

git fetch upstream

# Checkout my branch in this case names are same 
git checkout master 

# Merge the original upstream
git merge upsteam/master 
#+end_src
* Git Push 
Instead of providing branch name or set upstream branch we can 
always push current branch by 
#+begin_src shell 
git config --global push.autoSetupRemote true
#+end_src

